function explicitScheme
format short e
a=0;% начало промежутка по x
b=1;% конец промежутка по x
t0=0;% начало промежутка по t
tn=1;% конец промежутка по t
 
f=@(x,t)(4*pi^2-1)*exp(-t)*sin(2*pi*x);% функция для вычисления выражения без частных производных
n_x=10;% количество промежутков по x
n_t=n_x^3;% количество промежутков по t
h_x=(b-a)/n_x;% шаг по x
h_t=(tn-t0)/n_t;% шаг по t
 
k=h_t/(h_x*h_x);% коэффициент, на который накладывается условие устойчивости 

u_x_0=@(x)sin(2*pi*x);% начальное условие при t=0
u_0_t= 0;% граничное значение при x=a
t=t0:h_t:tn;% промежуток по t
u_1_t=0;% граничное значение при x=b
 
u_exact=zeros(n_t+1,n_x+1);% заполнение нулями для быстродействия программы
for i=1:n_t+1;% заполнение точного решения
  t(i)=t0+(i-1)*h_t;
  for j=1:n_x+1;
    x(j)=a+(j-1)*h_x;
    u_exact(i,j)=sin(2*pi*x(j))*exp(-t(i)); %точное решение
  end
end
 
u=zeros(n_t+1,n_x+1);% решение параболического уравнения
u(1,:)=u_x_0(x(:));% заполнение в матрице u начальных условий
u(:,1)=u_0_t;% заполнение в матрице u граничных условий при x=a
u(:,n_x+1)=u_1_t;% заполнение в матрице u граничных условий при x=b
 

 
for it=1:n_t;
     for ix=2:n_x;
         x(ix)=a+(ix-1)*h_x;
         u(it+1,ix)=k*u(it,ix+1)+(1-2*k)*u(it,ix)+k*u(it,ix-1)+h_t*f(x(ix),t(it));
     end
end
 
eps1 = max(abs(u-u_exact));
eps = max(eps1);% максимальная ошибка
H=[0.1 0.05 1/30 1/40 1/50 1/60 1/70 1/80 1/90 1/100];
Eps1=[2.8983e-002 7.5083e-003 3.3104e-003 1.8707e-003 1.1945e-003 8.3095e-004 6.0980e-004 4.6732e-004 3.6899e-004 2.9905e-004]; 
 
     plot(H,Eps1)
     loglog(H,Eps1)
     title('График зависимости ошибки eps от шага h')
     xlabel('Шаг h')
     ylabel('Ошибка eps')
     grid on
     
     %x1 = 0 : 0.001 : 1;
     %u_exact1= @(x1,t_slice)sin(2*pi*x1)*exp(-t_slice);%время, на котором мы рассматриваем срез
     
     %t1 = 1;
     %subplot(2,2,1),plot(x,u(t1,:),x1,u_exact1(x1,0))
     %title('Срез при t = 0')
     %xlabel('X')
     %ylabel('U')
     %grid on
    % 
    %t2 = 0.25*n_t;
    %subplot(2,2,2),plot(x,u(t2,:),x1,u_exact1(x1,0.25))
    %title('Срез при t = 0.25')
    %xlabel('X')
    %ylabel('U')
    %grid on
    
     %t3 = 0.5*n_t + 1;
     %subplot(2,2,3),plot(x,u(t3,:),x1,u_exact1(x1,0.5))     %title('Срез при t = 0.5')
     %title('Срез при t = 0.5')
     %xlabel('X')
     %ylabel('U')
     %grid on
    
     %t4 = 0.75*n_t + 1;
     %subplot(2,2,4),plot(x,u(t4,:),x1,u_exact1(x1,0.75))
     %title('Срез при t = 0.75')
     %xlabel('X')
     %ylabel('U')
     %grid on
     
     
     
     
